src/Catalogs/ЮрФиз/ЮрФиз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЮрФиз</name>
  <predefined>
    <items>
      <name>ФизЛицо</name>
      <description>FL</description>
    </items>
    <items>
      <name>ЮрЛицо</name>
      <description>UL</description>
    </items>
  </predefined>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ЮрФиз/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Add("Наименование");
	Поля.Add("Представление");
	СтандартнаяОбработка = false;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	if Данные.Представление<>"" then
		Представление = Данные.Представление;
	else  
		Представление = Данные.Наименование;
	endif;
	
	СтандартнаяОбработка = false;
КонецПроцедуры

procedure ЗаполнитьСправочник() export
	objФизЛицо=Справочники.ЮрФиз.ФизЛицо.GetObject();
	objФизЛицо.Представление = "ФЛ";
	objФизЛицо.Write();
	
	objФизЛицо=Справочники.ЮрФиз.ЮрЛицо.GetObject();
	objФизЛицо.Представление = "ЮЛ";
	objФизЛицо.Write();

endprocedure
